{"_id":{"$oid":"63f2cf9beb5d474f734a2ef4"},"Title":"Iron Man","Description":"Updated - A billionaire industrialist and genius inventor, Tony Stark (Robert Downey Jr.), is conducting weapons tests overseas, but terrorists kidnap him to force him to build a devastating weapon. Instead, he builds an armored suit and upends his captors. Returning to America, Stark refines the suit and uses it to combat crime and terrorism.","Genre":{"Name":"Action","Description":"Movies in the action genre are defined by risk and stakes. While many movies may feature an action sequence, to be appropriately categorized inside the action genre, the bulk of the content must be action-oriented, including fight scenes, stunts, car chases, and general danger."},"Director":{"Name":"Jon Favreau","Bio":"Jonathan Kolia Favreau is an American actor and filmmaker.","Birth":"1966"}}
{"_id":{"$oid":"63f53d88eb5d474f734a2ef5"},"Title":"The Incredible Hulk","Description":"Scientist Bruce Banner (Edward Norton) desperately seeks a cure for the gamma radiation that contaminated his cells and turned him into The Hulk. Cut off from his true love Betty Ross (Liv Tyler) and forced to hide from his nemesis, Gen. Thunderbolt Ross (William Hurt), Banner soon comes face-to-face with a new threat: a supremely powerful enemy known as The Abomination (Tim Roth).","Genre":{"Name":"Action","Description":"Movies in the action genre are defined by risk and stakes. While many movies may feature an action sequence, to be appropriately categorized inside the action genre, the bulk of the content must be action-oriented, including fight scenes, stunts, car chases, and general danger."},"Director":{"Name":"Louis Leterrier","Bio":"Louis Leterrier is a French film director and producer. Best known for his work in action films, he directed the first two Transporter films.","Birth":"1973"}}
{"_id":{"$oid":"63f54447eb5d474f734a2ef6"},"Title":"Iron Man 2","Description":"With the world now aware that he is Iron Man, billionaire inventor Tony Stark (Robert Downey Jr.) faces pressure from all sides to share his technology with the military. He is reluctant to divulge the secrets of his armored suit, fearing the information will fall into the wrong hands. With Pepper Potts (Gwyneth Paltrow) and 'Rhodey' Rhodes (Don Cheadle) by his side, Tony must forge new alliances and confront a powerful new enemy.","Genre":{"Name":"Action","Description":"Movies in the action genre are defined by risk and stakes. While many movies may feature an action sequence, to be appropriately categorized inside the action genre, the bulk of the content must be action-oriented, including fight scenes, stunts, car chases, and general danger."},"Director":{"Name":"Jon Favreau","Bio":"Jonathan Kolia Favreau is an American actor and filmmaker.","Birth":"1976"}}
{"_id":{"$oid":"63f54a95eb5d474f734a2ef7"},"Title":"Thor","Description":"As the son of Odin (Anthony Hopkins), king of the Norse gods, Thor (Chris Hemsworth) will soon inherit the throne of Asgard from his aging father. However, on the day that he is to be crowned, Thor reacts with brutality when the gods' enemies, the Frost Giants, enter the palace in violation of their treaty. As punishment, Odin banishes Thor to Earth. While Loki (Tom Hiddleston), Thor's brother, plots mischief in Asgard, Thor, now stripped of his powers, faces his greatest threat.","Genre":{"Name":"Fantasy","Description":"The fantasy genre is defined by both circumstance and setting inside a fictional universe with an unrealistic set of natural laws."},"Director":{"Name":"Kenneth Branagh","Bio":"Sir Kenneth Charles Branagh is a British actor and filmmaker.","Birth":"1960"}}
{"_id":{"$oid":"63f680eceb5d474f734a2ef8"},"Title":"CAPTAIN AMERICA: THE FIRST AVENGER","Description":"It is 1941 and the world is in the throes of war. Steve Rogers (Chris Evans) wants to do his part and join America's armed forces, but the military rejects him because of his small stature. Finally, Steve gets his chance when he is accepted into an experimental program that turns him into a supersoldier called Captain America. Joining forces with Bucky Barnes (Sebastian Stan) and Peggy Carter (Hayley Atwell), Captain America leads the fight against the Nazi-backed HYDRA organization.","Genre":{"Name":"Adventure","Description":"Movies in the adventure genre are defined by a journey, often including some form of pursuit, and can take place in any setting."},"Director":{"Name":"Joe Johnston","Bio":"Joseph Eggleston Johnston II is an American film director, producer, writer, and visual effects artist.","Birth":"1950"}}
{"_id":{"$oid":"63f68c62eb5d474f734a2ef9"},"Title":"Marvel's The First Avengers","Description":"When Thor's evil brother Loki (Tom Hiddleston), gains access to the unlimited power of the energy cube called the Tesseract, Nick Fury (Samuel L. Jackson), director of S.H.I.E.L.D. initiates a superhero recruitment effort to defeat the unprecedented threat to Earth.","Genre":{"Name":"Adventure","Description":"Movies in the adventure genre are defined by a journey, often including some form of pursuit, and can take place in any setting."},"Director":{"Name":"Joss Whedon","Bio":"Joesph Hill Whedon is an American filmmaker, composer, and comic book writer. He is the founder of Mutant Enemy Productions.","Birth":"1964"}}
{"_id":{"$oid":"63f69acceb5d474f734a2efa"},"Title":"Iron Man 3","Description":"Plagued with worry and insomnia since saving New York from destruction, Tony Stark (Robert DOwney Jr.), now, is more dependant on the suits tht give him his Iron Man persona.","Genre":{"Name":"Sci-Fi","Description":"Science fiction movies are defined by a mixture of speculation and science."},"Director":{"Name":"Shane Black","Bio":"Shane Black is an American filmmaker and actor.","Birth":"1961"}}
{"_id":{"$oid":"63f69f32eb5d474f734a2efb"},"Title":"Thor: The Dark World","Description":"When the Dark Elves attempt to plunge the universe into darkness, Thor must embark on a perilous and personal journey that will reunite him with doctor Jane Foster.","Genre":{"Name":"Fantasy","Desription":"The fantasy genre is defined by both circumstance and setting inside a fictional universe with an unrealistic set of natural laws."},"Director":{"Name":"Alan Taylor","Bio":"Alan Taylor is an American film and television director from San Francisco.","Birth":"1965"}}
{"_id":{"$oid":"63f6c04eeb5d474f734a2efc"},"Title":"Captain America: The Winter Soldier","Descripion":"After the cataclysmic events in New York with his fellow Avengers, Steve Rogers, aka Captain America (Chris Evans), lives in the nation's capital as he tries to adjust to modern times. An attack on a S.H.I.E.L.D. colleague throws Rogers into a web of intrigue that places the whole world at risk.","Genre":{"Name":"Action","Description":"Movies in the action genre are defined by risk and stakes. While many movies may feature an action sequence, to be appropriately categorized inside the action genre, the bulk of the content must be action-oriented, including fight scenes, stunts, car chases, and general danger."},"Director":{"Name":"Anthony Russo and Joe Russo","Bio":"Anthony and Joe Russo are American directors, producers, and screenwriters. They direct most of their work together.","Birth":"1970 and 1971"}}
{"_id":{"$oid":"63f6c1a9eb5d474f734a2efd"},"Title":"Gaurdians of the Galaxy","Description":"Brash space adventurer Peter Quill (Chris Pratt) finds himself the quarry of relentless bounty hunters after he steals an orb coveted by Ronan, a powerful villain.","Genre":{"Name":"Adventure","Description":"Movies in the adventure genre are defined by a journey, often including some form of pursuit, and can take place in any setting."},"Director":{"Name":"James Gunn","Bio":"James Francis Gunn Jr. is an American filmmaker and executive.","Birth":"1966"}}
